app/Controllers/Albumes.php

SELECT *
FROM `albums`
ORDER BY `id` ASC
---
    public function index(){
        $album = new Album();
        $datos['albums'] = $album->orderBy('id','ASC')->findAll();