app/Controllers/Genres.php

SELECT *
FROM `genres`
ORDER BY `id` ASC
---
    public function index(){
        $genre = new Genre();
        $datos['genres'] = $genre->orderBy('id','ASC')->findAll();